// -----// IR Dump After AssignLegacyTargetDevicesPass (iree-hal-assign-legacy-target-devices) //----- //
#config = #iree_cpu.lowering_config<distribution = [32, 16, 0, 0], vector_common_parallel = [0, 0, 0, 32]>
#config1 = #iree_cpu.lowering_config<distribution = [32, 16, 0, 0]>
#executable_target_embedded_elf_x86_64 = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", iree.encoding.resolver = #iree_cpu.cpu_encoding_resolver<>, max_stack_allocation_size = 32768 : i64, native_vector_size = 16 : i64, target_triple = "x86_64-unknown-unknown-eabi-elf"}>
#map = affine_map<(d0, d1, d2, d3) -> (d0, d1, d3)>
#map1 = affine_map<(d0, d1, d2, d3) -> (d0, d2, d3)>
#map2 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2)>
#map3 = affine_map<(d0, d1, d2) -> (d0, d1, d2)>
#map4 = affine_map<(d0, d1, d2, d3) -> (d0, d3, d2)>
#map5 = affine_map<(d0, d1, d2, d3) -> (d0, d1)>
#device_target_local = #hal.device.target<"local", [#executable_target_embedded_elf_x86_64]> : !hal.device
module attributes {hal.device.targets = [#device_target_local]} {
  util.func public @attention(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @attention(%input0: tensor<20x4096x64xf16>, %input1: tensor<20x4096x64xf16>, %input2: tensor<20x4096x64xf16>) -> (%output0: tensor<20x4096x64xf32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %3 = flow.dispatch.workgroups(%0, %1, %2) : (tensor<20x4096x64xf16>, tensor<20x4096x64xf16>, tensor<20x4096x64xf16>) -> tensor<20x4096x64xf32> =
        (%arg3: !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>>, %arg4: !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>>, %arg5: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x4096xf32>>, %arg6: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x64xf32>>) {
      %cst = arith.constant 0.000000e+00 : f32
      %cst_0 = arith.constant 1.250000e-01 : f32
      %5 = iree_tensor_ext.dispatch.tensor.load %arg3, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %6 = iree_tensor_ext.dispatch.tensor.load %arg4, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %7 = iree_tensor_ext.dispatch.tensor.load %arg4, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %8 = tensor.empty() : tensor<20x4096x4096xf32>
      %9 = linalg.fill ins(%cst : f32) outs(%8 : tensor<20x4096x4096xf32>) -> tensor<20x4096x4096xf32>
      %10 = linalg.generic {indexing_maps = [#map, #map1, #map2], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%5, %6 : tensor<20x4096x64xf16>, tensor<20x4096x64xf16>) outs(%9 : tensor<20x4096x4096xf32>) attrs =  {attention_qk_matmul, lowering_config = #config} {
      ^bb0(%in: f16, %in_1: f16, %out: f32):
        %18 = arith.extf %in : f16 to f32
        %19 = arith.extf %in_1 : f16 to f32
        %20 = arith.mulf %18, %19 : f32
        %21 = arith.addf %20, %out : f32
        linalg.yield %21 : f32
      } -> tensor<20x4096x4096xf32>
      %11 = linalg.generic {indexing_maps = [#map3, #map3], iterator_types = ["parallel", "parallel", "parallel"]} ins(%10 : tensor<20x4096x4096xf32>) outs(%8 : tensor<20x4096x4096xf32>) {
      ^bb0(%in: f32, %out: f32):
        %18 = arith.mulf %in, %cst_0 : f32
        linalg.yield %18 : f32
      } -> tensor<20x4096x4096xf32>
      %12 = tensor.empty() : tensor<20x4096x64xf32>
      %13 = tensor.empty() : tensor<20x4096xf32>
      %14 = linalg.fill ins(%cst_0 : f32) outs(%12 : tensor<20x4096x64xf32>) -> tensor<20x4096x64xf32>
      %15 = linalg.fill ins(%cst : f32) outs(%13 : tensor<20x4096xf32>) -> tensor<20x4096xf32>
      %16 = linalg.fill ins(%cst_0 : f32) outs(%13 : tensor<20x4096xf32>) -> tensor<20x4096xf32>
      %17:3 = iree_linalg_ext.exp_reduction{indexing_maps = [#map, #map4, #map5, #map5, #map2], iterator_types = [#iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<reduction>], exp_reduced_operands = [1, 2]} attributes {attention_pv_matmul, lowering_config = #config1} ins(%11, %7 : tensor<20x4096x4096xf32>, tensor<20x4096x64xf16>) outs(%15, %16, %14 : tensor<20x4096xf32>, tensor<20x4096xf32>, tensor<20x4096x64xf32>) {
      ^bb0(%arg7: f32, %arg8: f16, %arg9: f32, %arg10: f32, %arg11: f32):
        %18 = arith.addf %arg7, %arg10 : f32
        %19 = arith.truncf %arg7 : f32 to f16
        %20 = arith.extf %19 : f16 to f32
        %21 = arith.extf %arg8 : f16 to f32
        %22 = arith.mulf %20, %21 : f32
        %23 = arith.addf %22, %arg11 : f32
        iree_linalg_ext.yield %arg9, %18, %23 : f32, f32, f32
      } -> tensor<20x4096xf32>, tensor<20x4096xf32>, tensor<20x4096x64xf32>
      iree_tensor_ext.dispatch.tensor.store %17#2, %arg6, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : tensor<20x4096x64xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x64xf32>>
      flow.return
    } count() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    %4 = hal.tensor.export %3 "output0" : tensor<20x4096x64xf32> -> !hal.buffer_view
    util.return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After AssignTargetDevicesPass (iree-hal-assign-target-devices) //----- //
#config = #iree_cpu.lowering_config<distribution = [32, 16, 0, 0], vector_common_parallel = [0, 0, 0, 32]>
#config1 = #iree_cpu.lowering_config<distribution = [32, 16, 0, 0]>
#executable_target_embedded_elf_x86_64 = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", iree.encoding.resolver = #iree_cpu.cpu_encoding_resolver<>, max_stack_allocation_size = 32768 : i64, native_vector_size = 16 : i64, target_triple = "x86_64-unknown-unknown-eabi-elf"}>
#map = affine_map<(d0, d1, d2, d3) -> (d0, d1, d3)>
#map1 = affine_map<(d0, d1, d2, d3) -> (d0, d2, d3)>
#map2 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2)>
#map3 = affine_map<(d0, d1, d2) -> (d0, d1, d2)>
#map4 = affine_map<(d0, d1, d2, d3) -> (d0, d3, d2)>
#map5 = affine_map<(d0, d1, d2, d3) -> (d0, d1)>
#device_target_local = #hal.device.target<"local", [#executable_target_embedded_elf_x86_64]> : !hal.device
module attributes {hal.device.targets = [#device_target_local]} {
  util.func public @attention(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @attention(%input0: tensor<20x4096x64xf16>, %input1: tensor<20x4096x64xf16>, %input2: tensor<20x4096x64xf16>) -> (%output0: tensor<20x4096x64xf32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %3 = flow.dispatch.workgroups(%0, %1, %2) : (tensor<20x4096x64xf16>, tensor<20x4096x64xf16>, tensor<20x4096x64xf16>) -> tensor<20x4096x64xf32> =
        (%arg3: !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>>, %arg4: !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>>, %arg5: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x4096xf32>>, %arg6: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x64xf32>>) {
      %cst = arith.constant 0.000000e+00 : f32
      %cst_0 = arith.constant 1.250000e-01 : f32
      %5 = iree_tensor_ext.dispatch.tensor.load %arg3, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %6 = iree_tensor_ext.dispatch.tensor.load %arg4, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %7 = iree_tensor_ext.dispatch.tensor.load %arg4, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %8 = tensor.empty() : tensor<20x4096x4096xf32>
      %9 = linalg.fill ins(%cst : f32) outs(%8 : tensor<20x4096x4096xf32>) -> tensor<20x4096x4096xf32>
      %10 = linalg.generic {indexing_maps = [#map, #map1, #map2], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%5, %6 : tensor<20x4096x64xf16>, tensor<20x4096x64xf16>) outs(%9 : tensor<20x4096x4096xf32>) attrs =  {attention_qk_matmul, lowering_config = #config} {
      ^bb0(%in: f16, %in_1: f16, %out: f32):
        %18 = arith.extf %in : f16 to f32
        %19 = arith.extf %in_1 : f16 to f32
        %20 = arith.mulf %18, %19 : f32
        %21 = arith.addf %20, %out : f32
        linalg.yield %21 : f32
      } -> tensor<20x4096x4096xf32>
      %11 = linalg.generic {indexing_maps = [#map3, #map3], iterator_types = ["parallel", "parallel", "parallel"]} ins(%10 : tensor<20x4096x4096xf32>) outs(%8 : tensor<20x4096x4096xf32>) {
      ^bb0(%in: f32, %out: f32):
        %18 = arith.mulf %in, %cst_0 : f32
        linalg.yield %18 : f32
      } -> tensor<20x4096x4096xf32>
      %12 = tensor.empty() : tensor<20x4096x64xf32>
      %13 = tensor.empty() : tensor<20x4096xf32>
      %14 = linalg.fill ins(%cst_0 : f32) outs(%12 : tensor<20x4096x64xf32>) -> tensor<20x4096x64xf32>
      %15 = linalg.fill ins(%cst : f32) outs(%13 : tensor<20x4096xf32>) -> tensor<20x4096xf32>
      %16 = linalg.fill ins(%cst_0 : f32) outs(%13 : tensor<20x4096xf32>) -> tensor<20x4096xf32>
      %17:3 = iree_linalg_ext.exp_reduction{indexing_maps = [#map, #map4, #map5, #map5, #map2], iterator_types = [#iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<reduction>], exp_reduced_operands = [1, 2]} attributes {attention_pv_matmul, lowering_config = #config1} ins(%11, %7 : tensor<20x4096x4096xf32>, tensor<20x4096x64xf16>) outs(%15, %16, %14 : tensor<20x4096xf32>, tensor<20x4096xf32>, tensor<20x4096x64xf32>) {
      ^bb0(%arg7: f32, %arg8: f16, %arg9: f32, %arg10: f32, %arg11: f32):
        %18 = arith.addf %arg7, %arg10 : f32
        %19 = arith.truncf %arg7 : f32 to f16
        %20 = arith.extf %19 : f16 to f32
        %21 = arith.extf %arg8 : f16 to f32
        %22 = arith.mulf %20, %21 : f32
        %23 = arith.addf %22, %arg11 : f32
        iree_linalg_ext.yield %arg9, %18, %23 : f32, f32, f32
      } -> tensor<20x4096xf32>, tensor<20x4096xf32>, tensor<20x4096x64xf32>
      iree_tensor_ext.dispatch.tensor.store %17#2, %arg6, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : tensor<20x4096x64xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x64xf32>>
      flow.return
    } count() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    %4 = hal.tensor.export %3 "output0" : tensor<20x4096x64xf32> -> !hal.buffer_view
    util.return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After MaterializeTargetDevicesPass (iree-hal-materialize-target-devices) //----- //
#config = #iree_cpu.lowering_config<distribution = [32, 16, 0, 0], vector_common_parallel = [0, 0, 0, 32]>
#config1 = #iree_cpu.lowering_config<distribution = [32, 16, 0, 0]>
#executable_target_embedded_elf_x86_64 = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", iree.encoding.resolver = #iree_cpu.cpu_encoding_resolver<>, max_stack_allocation_size = 32768 : i64, native_vector_size = 16 : i64, target_triple = "x86_64-unknown-unknown-eabi-elf"}>
#map = affine_map<(d0, d1, d2, d3) -> (d0, d1, d3)>
#map1 = affine_map<(d0, d1, d2, d3) -> (d0, d2, d3)>
#map2 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2)>
#map3 = affine_map<(d0, d1, d2) -> (d0, d1, d2)>
#map4 = affine_map<(d0, d1, d2, d3) -> (d0, d3, d2)>
#map5 = affine_map<(d0, d1, d2, d3) -> (d0, d1)>
#device_target_local = #hal.device.target<"local", [#executable_target_embedded_elf_x86_64]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_local
  util.func public @attention(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @attention(%input0: tensor<20x4096x64xf16>, %input1: tensor<20x4096x64xf16>, %input2: tensor<20x4096x64xf16>) -> (%output0: tensor<20x4096x64xf32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %3 = flow.dispatch.workgroups(%0, %1, %2) : (tensor<20x4096x64xf16>, tensor<20x4096x64xf16>, tensor<20x4096x64xf16>) -> tensor<20x4096x64xf32> =
        (%arg3: !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>>, %arg4: !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>>, %arg5: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x4096xf32>>, %arg6: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x64xf32>>) {
      %cst = arith.constant 0.000000e+00 : f32
      %cst_0 = arith.constant 1.250000e-01 : f32
      %5 = iree_tensor_ext.dispatch.tensor.load %arg3, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %6 = iree_tensor_ext.dispatch.tensor.load %arg4, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %7 = iree_tensor_ext.dispatch.tensor.load %arg4, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %8 = tensor.empty() : tensor<20x4096x4096xf32>
      %9 = linalg.fill ins(%cst : f32) outs(%8 : tensor<20x4096x4096xf32>) -> tensor<20x4096x4096xf32>
      %10 = linalg.generic {indexing_maps = [#map, #map1, #map2], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%5, %6 : tensor<20x4096x64xf16>, tensor<20x4096x64xf16>) outs(%9 : tensor<20x4096x4096xf32>) attrs =  {attention_qk_matmul, lowering_config = #config} {
      ^bb0(%in: f16, %in_1: f16, %out: f32):
        %18 = arith.extf %in : f16 to f32
        %19 = arith.extf %in_1 : f16 to f32
        %20 = arith.mulf %18, %19 : f32
        %21 = arith.addf %20, %out : f32
        linalg.yield %21 : f32
      } -> tensor<20x4096x4096xf32>
      %11 = linalg.generic {indexing_maps = [#map3, #map3], iterator_types = ["parallel", "parallel", "parallel"]} ins(%10 : tensor<20x4096x4096xf32>) outs(%8 : tensor<20x4096x4096xf32>) {
      ^bb0(%in: f32, %out: f32):
        %18 = arith.mulf %in, %cst_0 : f32
        linalg.yield %18 : f32
      } -> tensor<20x4096x4096xf32>
      %12 = tensor.empty() : tensor<20x4096x64xf32>
      %13 = tensor.empty() : tensor<20x4096xf32>
      %14 = linalg.fill ins(%cst_0 : f32) outs(%12 : tensor<20x4096x64xf32>) -> tensor<20x4096x64xf32>
      %15 = linalg.fill ins(%cst : f32) outs(%13 : tensor<20x4096xf32>) -> tensor<20x4096xf32>
      %16 = linalg.fill ins(%cst_0 : f32) outs(%13 : tensor<20x4096xf32>) -> tensor<20x4096xf32>
      %17:3 = iree_linalg_ext.exp_reduction{indexing_maps = [#map, #map4, #map5, #map5, #map2], iterator_types = [#iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<reduction>], exp_reduced_operands = [1, 2]} attributes {attention_pv_matmul, lowering_config = #config1} ins(%11, %7 : tensor<20x4096x4096xf32>, tensor<20x4096x64xf16>) outs(%15, %16, %14 : tensor<20x4096xf32>, tensor<20x4096xf32>, tensor<20x4096x64xf32>) {
      ^bb0(%arg7: f32, %arg8: f16, %arg9: f32, %arg10: f32, %arg11: f32):
        %18 = arith.addf %arg7, %arg10 : f32
        %19 = arith.truncf %arg7 : f32 to f16
        %20 = arith.extf %19 : f16 to f32
        %21 = arith.extf %arg8 : f16 to f32
        %22 = arith.mulf %20, %21 : f32
        %23 = arith.addf %22, %arg11 : f32
        iree_linalg_ext.yield %arg9, %18, %23 : f32, f32, f32
      } -> tensor<20x4096xf32>, tensor<20x4096xf32>, tensor<20x4096x64xf32>
      iree_tensor_ext.dispatch.tensor.store %17#2, %arg6, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : tensor<20x4096x64xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x64xf32>>
      flow.return
    } count() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    %4 = hal.tensor.export %3 "output0" : tensor<20x4096x64xf32> -> !hal.buffer_view
    util.return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After ResolveDevicePromisesPass (iree-hal-resolve-device-promises) //----- //
#config = #iree_cpu.lowering_config<distribution = [32, 16, 0, 0], vector_common_parallel = [0, 0, 0, 32]>
#config1 = #iree_cpu.lowering_config<distribution = [32, 16, 0, 0]>
#executable_target_embedded_elf_x86_64 = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", iree.encoding.resolver = #iree_cpu.cpu_encoding_resolver<>, max_stack_allocation_size = 32768 : i64, native_vector_size = 16 : i64, target_triple = "x86_64-unknown-unknown-eabi-elf"}>
#map = affine_map<(d0, d1, d2, d3) -> (d0, d1, d3)>
#map1 = affine_map<(d0, d1, d2, d3) -> (d0, d2, d3)>
#map2 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2)>
#map3 = affine_map<(d0, d1, d2) -> (d0, d1, d2)>
#map4 = affine_map<(d0, d1, d2, d3) -> (d0, d3, d2)>
#map5 = affine_map<(d0, d1, d2, d3) -> (d0, d1)>
#device_target_local = #hal.device.target<"local", [#executable_target_embedded_elf_x86_64]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_local
  util.func public @attention(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @attention(%input0: tensor<20x4096x64xf16>, %input1: tensor<20x4096x64xf16>, %input2: tensor<20x4096x64xf16>) -> (%output0: tensor<20x4096x64xf32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %3 = flow.dispatch.workgroups(%0, %1, %2) : (tensor<20x4096x64xf16>, tensor<20x4096x64xf16>, tensor<20x4096x64xf16>) -> tensor<20x4096x64xf32> =
        (%arg3: !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>>, %arg4: !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>>, %arg5: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x4096xf32>>, %arg6: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x64xf32>>) {
      %cst = arith.constant 0.000000e+00 : f32
      %cst_0 = arith.constant 1.250000e-01 : f32
      %5 = iree_tensor_ext.dispatch.tensor.load %arg3, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %6 = iree_tensor_ext.dispatch.tensor.load %arg4, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %7 = iree_tensor_ext.dispatch.tensor.load %arg4, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %8 = tensor.empty() : tensor<20x4096x4096xf32>
      %9 = linalg.fill ins(%cst : f32) outs(%8 : tensor<20x4096x4096xf32>) -> tensor<20x4096x4096xf32>
      %10 = linalg.generic {indexing_maps = [#map, #map1, #map2], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%5, %6 : tensor<20x4096x64xf16>, tensor<20x4096x64xf16>) outs(%9 : tensor<20x4096x4096xf32>) attrs =  {attention_qk_matmul, lowering_config = #config} {
      ^bb0(%in: f16, %in_1: f16, %out: f32):
        %18 = arith.extf %in : f16 to f32
        %19 = arith.extf %in_1 : f16 to f32
        %20 = arith.mulf %18, %19 : f32
        %21 = arith.addf %20, %out : f32
        linalg.yield %21 : f32
      } -> tensor<20x4096x4096xf32>
      %11 = linalg.generic {indexing_maps = [#map3, #map3], iterator_types = ["parallel", "parallel", "parallel"]} ins(%10 : tensor<20x4096x4096xf32>) outs(%8 : tensor<20x4096x4096xf32>) {
      ^bb0(%in: f32, %out: f32):
        %18 = arith.mulf %in, %cst_0 : f32
        linalg.yield %18 : f32
      } -> tensor<20x4096x4096xf32>
      %12 = tensor.empty() : tensor<20x4096x64xf32>
      %13 = tensor.empty() : tensor<20x4096xf32>
      %14 = linalg.fill ins(%cst_0 : f32) outs(%12 : tensor<20x4096x64xf32>) -> tensor<20x4096x64xf32>
      %15 = linalg.fill ins(%cst : f32) outs(%13 : tensor<20x4096xf32>) -> tensor<20x4096xf32>
      %16 = linalg.fill ins(%cst_0 : f32) outs(%13 : tensor<20x4096xf32>) -> tensor<20x4096xf32>
      %17:3 = iree_linalg_ext.exp_reduction{indexing_maps = [#map, #map4, #map5, #map5, #map2], iterator_types = [#iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<reduction>], exp_reduced_operands = [1, 2]} attributes {attention_pv_matmul, lowering_config = #config1} ins(%11, %7 : tensor<20x4096x4096xf32>, tensor<20x4096x64xf16>) outs(%15, %16, %14 : tensor<20x4096xf32>, tensor<20x4096xf32>, tensor<20x4096x64xf32>) {
      ^bb0(%arg7: f32, %arg8: f16, %arg9: f32, %arg10: f32, %arg11: f32):
        %18 = arith.addf %arg7, %arg10 : f32
        %19 = arith.truncf %arg7 : f32 to f16
        %20 = arith.extf %19 : f16 to f32
        %21 = arith.extf %arg8 : f16 to f32
        %22 = arith.mulf %20, %21 : f32
        %23 = arith.addf %22, %arg11 : f32
        iree_linalg_ext.yield %arg9, %18, %23 : f32, f32, f32
      } -> tensor<20x4096xf32>, tensor<20x4096xf32>, tensor<20x4096x64xf32>
      iree_tensor_ext.dispatch.tensor.store %17#2, %arg6, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : tensor<20x4096x64xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x64xf32>>
      flow.return
    } count() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    %4 = hal.tensor.export %3 "output0" : tensor<20x4096x64xf32> -> !hal.buffer_view
    util.return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After ResolveDeviceAliasesPass (iree-hal-resolve-device-aliases) //----- //
#config = #iree_cpu.lowering_config<distribution = [32, 16, 0, 0], vector_common_parallel = [0, 0, 0, 32]>
#config1 = #iree_cpu.lowering_config<distribution = [32, 16, 0, 0]>
#executable_target_embedded_elf_x86_64 = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", iree.encoding.resolver = #iree_cpu.cpu_encoding_resolver<>, max_stack_allocation_size = 32768 : i64, native_vector_size = 16 : i64, target_triple = "x86_64-unknown-unknown-eabi-elf"}>
#map = affine_map<(d0, d1, d2, d3) -> (d0, d1, d3)>
#map1 = affine_map<(d0, d1, d2, d3) -> (d0, d2, d3)>
#map2 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2)>
#map3 = affine_map<(d0, d1, d2) -> (d0, d1, d2)>
#map4 = affine_map<(d0, d1, d2, d3) -> (d0, d3, d2)>
#map5 = affine_map<(d0, d1, d2, d3) -> (d0, d1)>
#device_target_local = #hal.device.target<"local", [#executable_target_embedded_elf_x86_64]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_local
  util.func public @attention(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @attention(%input0: tensor<20x4096x64xf16>, %input1: tensor<20x4096x64xf16>, %input2: tensor<20x4096x64xf16>) -> (%output0: tensor<20x4096x64xf32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %3 = flow.dispatch.workgroups(%0, %1, %2) : (tensor<20x4096x64xf16>, tensor<20x4096x64xf16>, tensor<20x4096x64xf16>) -> tensor<20x4096x64xf32> =
        (%arg3: !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>>, %arg4: !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>>, %arg5: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x4096xf32>>, %arg6: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x64xf32>>) {
      %cst = arith.constant 0.000000e+00 : f32
      %cst_0 = arith.constant 1.250000e-01 : f32
      %5 = iree_tensor_ext.dispatch.tensor.load %arg3, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %6 = iree_tensor_ext.dispatch.tensor.load %arg4, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %7 = iree_tensor_ext.dispatch.tensor.load %arg4, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %8 = tensor.empty() : tensor<20x4096x4096xf32>
      %9 = linalg.fill ins(%cst : f32) outs(%8 : tensor<20x4096x4096xf32>) -> tensor<20x4096x4096xf32>
      %10 = linalg.generic {indexing_maps = [#map, #map1, #map2], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%5, %6 : tensor<20x4096x64xf16>, tensor<20x4096x64xf16>) outs(%9 : tensor<20x4096x4096xf32>) attrs =  {attention_qk_matmul, lowering_config = #config} {
      ^bb0(%in: f16, %in_1: f16, %out: f32):
        %18 = arith.extf %in : f16 to f32
        %19 = arith.extf %in_1 : f16 to f32
        %20 = arith.mulf %18, %19 : f32
        %21 = arith.addf %20, %out : f32
        linalg.yield %21 : f32
      } -> tensor<20x4096x4096xf32>
      %11 = linalg.generic {indexing_maps = [#map3, #map3], iterator_types = ["parallel", "parallel", "parallel"]} ins(%10 : tensor<20x4096x4096xf32>) outs(%8 : tensor<20x4096x4096xf32>) {
      ^bb0(%in: f32, %out: f32):
        %18 = arith.mulf %in, %cst_0 : f32
        linalg.yield %18 : f32
      } -> tensor<20x4096x4096xf32>
      %12 = tensor.empty() : tensor<20x4096x64xf32>
      %13 = tensor.empty() : tensor<20x4096xf32>
      %14 = linalg.fill ins(%cst_0 : f32) outs(%12 : tensor<20x4096x64xf32>) -> tensor<20x4096x64xf32>
      %15 = linalg.fill ins(%cst : f32) outs(%13 : tensor<20x4096xf32>) -> tensor<20x4096xf32>
      %16 = linalg.fill ins(%cst_0 : f32) outs(%13 : tensor<20x4096xf32>) -> tensor<20x4096xf32>
      %17:3 = iree_linalg_ext.exp_reduction{indexing_maps = [#map, #map4, #map5, #map5, #map2], iterator_types = [#iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<reduction>], exp_reduced_operands = [1, 2]} attributes {attention_pv_matmul, lowering_config = #config1} ins(%11, %7 : tensor<20x4096x4096xf32>, tensor<20x4096x64xf16>) outs(%15, %16, %14 : tensor<20x4096xf32>, tensor<20x4096xf32>, tensor<20x4096x64xf32>) {
      ^bb0(%arg7: f32, %arg8: f16, %arg9: f32, %arg10: f32, %arg11: f32):
        %18 = arith.addf %arg7, %arg10 : f32
        %19 = arith.truncf %arg7 : f32 to f16
        %20 = arith.extf %19 : f16 to f32
        %21 = arith.extf %arg8 : f16 to f32
        %22 = arith.mulf %20, %21 : f32
        %23 = arith.addf %22, %arg11 : f32
        iree_linalg_ext.yield %arg9, %18, %23 : f32, f32, f32
      } -> tensor<20x4096xf32>, tensor<20x4096xf32>, tensor<20x4096x64xf32>
      iree_tensor_ext.dispatch.tensor.store %17#2, %arg6, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : tensor<20x4096x64xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x64xf32>>
      flow.return
    } count() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    %4 = hal.tensor.export %3 "output0" : tensor<20x4096x64xf32> -> !hal.buffer_view
    util.return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After VerifyDevicesPass (iree-hal-verify-devices) //----- //
#config = #iree_cpu.lowering_config<distribution = [32, 16, 0, 0], vector_common_parallel = [0, 0, 0, 32]>
#config1 = #iree_cpu.lowering_config<distribution = [32, 16, 0, 0]>
#executable_target_embedded_elf_x86_64 = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", iree.encoding.resolver = #iree_cpu.cpu_encoding_resolver<>, max_stack_allocation_size = 32768 : i64, native_vector_size = 16 : i64, target_triple = "x86_64-unknown-unknown-eabi-elf"}>
#map = affine_map<(d0, d1, d2, d3) -> (d0, d1, d3)>
#map1 = affine_map<(d0, d1, d2, d3) -> (d0, d2, d3)>
#map2 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2)>
#map3 = affine_map<(d0, d1, d2) -> (d0, d1, d2)>
#map4 = affine_map<(d0, d1, d2, d3) -> (d0, d3, d2)>
#map5 = affine_map<(d0, d1, d2, d3) -> (d0, d1)>
#device_target_local = #hal.device.target<"local", [#executable_target_embedded_elf_x86_64]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_local
  util.func public @attention(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @attention(%input0: tensor<20x4096x64xf16>, %input1: tensor<20x4096x64xf16>, %input2: tensor<20x4096x64xf16>) -> (%output0: tensor<20x4096x64xf32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %3 = flow.dispatch.workgroups(%0, %1, %2) : (tensor<20x4096x64xf16>, tensor<20x4096x64xf16>, tensor<20x4096x64xf16>) -> tensor<20x4096x64xf32> =
        (%arg3: !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>>, %arg4: !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>>, %arg5: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x4096xf32>>, %arg6: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x64xf32>>) {
      %cst = arith.constant 0.000000e+00 : f32
      %cst_0 = arith.constant 1.250000e-01 : f32
      %5 = iree_tensor_ext.dispatch.tensor.load %arg3, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %6 = iree_tensor_ext.dispatch.tensor.load %arg4, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %7 = iree_tensor_ext.dispatch.tensor.load %arg4, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %8 = tensor.empty() : tensor<20x4096x4096xf32>
      %9 = linalg.fill ins(%cst : f32) outs(%8 : tensor<20x4096x4096xf32>) -> tensor<20x4096x4096xf32>
      %10 = linalg.generic {indexing_maps = [#map, #map1, #map2], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%5, %6 : tensor<20x4096x64xf16>, tensor<20x4096x64xf16>) outs(%9 : tensor<20x4096x4096xf32>) attrs =  {attention_qk_matmul, lowering_config = #config} {
      ^bb0(%in: f16, %in_1: f16, %out: f32):
        %18 = arith.extf %in : f16 to f32
        %19 = arith.extf %in_1 : f16 to f32
        %20 = arith.mulf %18, %19 : f32
        %21 = arith.addf %20, %out : f32
        linalg.yield %21 : f32
      } -> tensor<20x4096x4096xf32>
      %11 = linalg.generic {indexing_maps = [#map3, #map3], iterator_types = ["parallel", "parallel", "parallel"]} ins(%10 : tensor<20x4096x4096xf32>) outs(%8 : tensor<20x4096x4096xf32>) {
      ^bb0(%in: f32, %out: f32):
        %18 = arith.mulf %in, %cst_0 : f32
        linalg.yield %18 : f32
      } -> tensor<20x4096x4096xf32>
      %12 = tensor.empty() : tensor<20x4096x64xf32>
      %13 = tensor.empty() : tensor<20x4096xf32>
      %14 = linalg.fill ins(%cst_0 : f32) outs(%12 : tensor<20x4096x64xf32>) -> tensor<20x4096x64xf32>
      %15 = linalg.fill ins(%cst : f32) outs(%13 : tensor<20x4096xf32>) -> tensor<20x4096xf32>
      %16 = linalg.fill ins(%cst_0 : f32) outs(%13 : tensor<20x4096xf32>) -> tensor<20x4096xf32>
      %17:3 = iree_linalg_ext.exp_reduction{indexing_maps = [#map, #map4, #map5, #map5, #map2], iterator_types = [#iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<reduction>], exp_reduced_operands = [1, 2]} attributes {attention_pv_matmul, lowering_config = #config1} ins(%11, %7 : tensor<20x4096x4096xf32>, tensor<20x4096x64xf16>) outs(%15, %16, %14 : tensor<20x4096xf32>, tensor<20x4096xf32>, tensor<20x4096x64xf32>) {
      ^bb0(%arg7: f32, %arg8: f16, %arg9: f32, %arg10: f32, %arg11: f32):
        %18 = arith.addf %arg7, %arg10 : f32
        %19 = arith.truncf %arg7 : f32 to f16
        %20 = arith.extf %19 : f16 to f32
        %21 = arith.extf %arg8 : f16 to f32
        %22 = arith.mulf %20, %21 : f32
        %23 = arith.addf %22, %arg11 : f32
        iree_linalg_ext.yield %arg9, %18, %23 : f32, f32, f32
      } -> tensor<20x4096xf32>, tensor<20x4096xf32>, tensor<20x4096x64xf32>
      iree_tensor_ext.dispatch.tensor.store %17#2, %arg6, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : tensor<20x4096x64xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x64xf32>>
      flow.return
    } count() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    %4 = hal.tensor.export %3 "output0" : tensor<20x4096x64xf32> -> !hal.buffer_view
    util.return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After VerifyInputLegalityPass (iree-verify-input-legality) //----- //
#config = #iree_cpu.lowering_config<distribution = [32, 16, 0, 0], vector_common_parallel = [0, 0, 0, 32]>
#config1 = #iree_cpu.lowering_config<distribution = [32, 16, 0, 0]>
#executable_target_embedded_elf_x86_64 = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", iree.encoding.resolver = #iree_cpu.cpu_encoding_resolver<>, max_stack_allocation_size = 32768 : i64, native_vector_size = 16 : i64, target_triple = "x86_64-unknown-unknown-eabi-elf"}>
#map = affine_map<(d0, d1, d2, d3) -> (d0, d1, d3)>
#map1 = affine_map<(d0, d1, d2, d3) -> (d0, d2, d3)>
#map2 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2)>
#map3 = affine_map<(d0, d1, d2) -> (d0, d1, d2)>
#map4 = affine_map<(d0, d1, d2, d3) -> (d0, d3, d2)>
#map5 = affine_map<(d0, d1, d2, d3) -> (d0, d1)>
#device_target_local = #hal.device.target<"local", [#executable_target_embedded_elf_x86_64]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_local
  util.func public @attention(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @attention(%input0: tensor<20x4096x64xf16>, %input1: tensor<20x4096x64xf16>, %input2: tensor<20x4096x64xf16>) -> (%output0: tensor<20x4096x64xf32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %3 = flow.dispatch.workgroups(%0, %1, %2) : (tensor<20x4096x64xf16>, tensor<20x4096x64xf16>, tensor<20x4096x64xf16>) -> tensor<20x4096x64xf32> =
        (%arg3: !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>>, %arg4: !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>>, %arg5: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x4096xf32>>, %arg6: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x64xf32>>) {
      %cst = arith.constant 0.000000e+00 : f32
      %cst_0 = arith.constant 1.250000e-01 : f32
      %5 = iree_tensor_ext.dispatch.tensor.load %arg3, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %6 = iree_tensor_ext.dispatch.tensor.load %arg4, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %7 = iree_tensor_ext.dispatch.tensor.load %arg4, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %8 = tensor.empty() : tensor<20x4096x4096xf32>
      %9 = linalg.fill ins(%cst : f32) outs(%8 : tensor<20x4096x4096xf32>) -> tensor<20x4096x4096xf32>
      %10 = linalg.generic {indexing_maps = [#map, #map1, #map2], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%5, %6 : tensor<20x4096x64xf16>, tensor<20x4096x64xf16>) outs(%9 : tensor<20x4096x4096xf32>) attrs =  {attention_qk_matmul, lowering_config = #config} {
      ^bb0(%in: f16, %in_1: f16, %out: f32):
        %18 = arith.extf %in : f16 to f32
        %19 = arith.extf %in_1 : f16 to f32
        %20 = arith.mulf %18, %19 : f32
        %21 = arith.addf %20, %out : f32
        linalg.yield %21 : f32
      } -> tensor<20x4096x4096xf32>
      %11 = linalg.generic {indexing_maps = [#map3, #map3], iterator_types = ["parallel", "parallel", "parallel"]} ins(%10 : tensor<20x4096x4096xf32>) outs(%8 : tensor<20x4096x4096xf32>) {
      ^bb0(%in: f32, %out: f32):
        %18 = arith.mulf %in, %cst_0 : f32
        linalg.yield %18 : f32
      } -> tensor<20x4096x4096xf32>
      %12 = tensor.empty() : tensor<20x4096x64xf32>
      %13 = tensor.empty() : tensor<20x4096xf32>
      %14 = linalg.fill ins(%cst_0 : f32) outs(%12 : tensor<20x4096x64xf32>) -> tensor<20x4096x64xf32>
      %15 = linalg.fill ins(%cst : f32) outs(%13 : tensor<20x4096xf32>) -> tensor<20x4096xf32>
      %16 = linalg.fill ins(%cst_0 : f32) outs(%13 : tensor<20x4096xf32>) -> tensor<20x4096xf32>
      %17:3 = iree_linalg_ext.exp_reduction{indexing_maps = [#map, #map4, #map5, #map5, #map2], iterator_types = [#iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<reduction>], exp_reduced_operands = [1, 2]} attributes {attention_pv_matmul, lowering_config = #config1} ins(%11, %7 : tensor<20x4096x4096xf32>, tensor<20x4096x64xf16>) outs(%15, %16, %14 : tensor<20x4096xf32>, tensor<20x4096xf32>, tensor<20x4096x64xf32>) {
      ^bb0(%arg7: f32, %arg8: f16, %arg9: f32, %arg10: f32, %arg11: f32):
        %18 = arith.addf %arg7, %arg10 : f32
        %19 = arith.truncf %arg7 : f32 to f16
        %20 = arith.extf %19 : f16 to f32
        %21 = arith.extf %arg8 : f16 to f32
        %22 = arith.mulf %20, %21 : f32
        %23 = arith.addf %22, %arg11 : f32
        iree_linalg_ext.yield %arg9, %18, %23 : f32, f32, f32
      } -> tensor<20x4096xf32>, tensor<20x4096xf32>, tensor<20x4096x64xf32>
      iree_tensor_ext.dispatch.tensor.store %17#2, %arg6, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : tensor<20x4096x64xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x64xf32>>
      flow.return
    } count() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    %4 = hal.tensor.export %3 "output0" : tensor<20x4096x64xf32> -> !hal.buffer_view
    util.return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After VerifyInitializationOrderPass (iree-util-verify-initialization-order) //----- //
#config = #iree_cpu.lowering_config<distribution = [32, 16, 0, 0], vector_common_parallel = [0, 0, 0, 32]>
#config1 = #iree_cpu.lowering_config<distribution = [32, 16, 0, 0]>
#executable_target_embedded_elf_x86_64 = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", iree.encoding.resolver = #iree_cpu.cpu_encoding_resolver<>, max_stack_allocation_size = 32768 : i64, native_vector_size = 16 : i64, target_triple = "x86_64-unknown-unknown-eabi-elf"}>
#map = affine_map<(d0, d1, d2, d3) -> (d0, d1, d3)>
#map1 = affine_map<(d0, d1, d2, d3) -> (d0, d2, d3)>
#map2 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2)>
#map3 = affine_map<(d0, d1, d2) -> (d0, d1, d2)>
#map4 = affine_map<(d0, d1, d2, d3) -> (d0, d3, d2)>
#map5 = affine_map<(d0, d1, d2, d3) -> (d0, d1)>
#device_target_local = #hal.device.target<"local", [#executable_target_embedded_elf_x86_64]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_local
  util.func public @attention(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @attention(%input0: tensor<20x4096x64xf16>, %input1: tensor<20x4096x64xf16>, %input2: tensor<20x4096x64xf16>) -> (%output0: tensor<20x4096x64xf32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %2 = hal.tensor.import %arg2 "input2" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %3 = flow.dispatch.workgroups(%0, %1, %2) : (tensor<20x4096x64xf16>, tensor<20x4096x64xf16>, tensor<20x4096x64xf16>) -> tensor<20x4096x64xf32> =
        (%arg3: !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>>, %arg4: !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>>, %arg5: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x4096xf32>>, %arg6: !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x64xf32>>) {
      %cst = arith.constant 0.000000e+00 : f32
      %cst_0 = arith.constant 1.250000e-01 : f32
      %5 = iree_tensor_ext.dispatch.tensor.load %arg3, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %6 = iree_tensor_ext.dispatch.tensor.load %arg4, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %7 = iree_tensor_ext.dispatch.tensor.load %arg4, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : !iree_tensor_ext.dispatch.tensor<readonly:tensor<20x4096x64xf16>> -> tensor<20x4096x64xf16>
      %8 = tensor.empty() : tensor<20x4096x4096xf32>
      %9 = linalg.fill ins(%cst : f32) outs(%8 : tensor<20x4096x4096xf32>) -> tensor<20x4096x4096xf32>
      %10 = linalg.generic {indexing_maps = [#map, #map1, #map2], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%5, %6 : tensor<20x4096x64xf16>, tensor<20x4096x64xf16>) outs(%9 : tensor<20x4096x4096xf32>) attrs =  {attention_qk_matmul, lowering_config = #config} {
      ^bb0(%in: f16, %in_1: f16, %out: f32):
        %18 = arith.extf %in : f16 to f32
        %19 = arith.extf %in_1 : f16 to f32
        %20 = arith.mulf %18, %19 : f32
        %21 = arith.addf %20, %out : f32
        linalg.yield %21 : f32
      } -> tensor<20x4096x4096xf32>
      %11 = linalg.generic {indexing_maps = [#map3, #map3], iterator_types = ["parallel", "parallel", "parallel"]} ins(%10 : tensor<20x4096x4096xf32>) outs(%8 : tensor<20x4096x4096xf32>) {
      ^bb0(%in: f32, %out: f32):
        %18 = arith.mulf %in, %cst_0 : f32
        linalg.yield %18 : f32
      } -> tensor<20x4096x4096xf32>
      %12 = tensor.empty() : tensor<20x4096x64xf32>
      %13 = tensor.empty() : tensor<20x4096xf32>
      %14 = linalg.fill ins(%cst_0 : f32) outs(%12 : tensor<20x4096x64xf32>) -> tensor<20x4096x64xf32>
      %15 = linalg.fill ins(%cst : f32) outs(%13 : tensor<20x4096xf32>) -> tensor<20x4096xf32>
      %16 = linalg.fill ins(%cst_0 : f32) outs(%13 : tensor<20x4096xf32>) -> tensor<20x4096xf32>
      %17:3 = iree_linalg_ext.exp_reduction{indexing_maps = [#map, #map4, #map5, #map5, #map2], iterator_types = [#iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<parallel>, #iree_linalg_ext.iterator_type<reduction>], exp_reduced_operands = [1, 2]} attributes {attention_pv_matmul, lowering_config = #config1} ins(%11, %7 : tensor<20x4096x4096xf32>, tensor<20x4096x64xf16>) outs(%15, %16, %14 : tensor<20x4096xf32>, tensor<20x4096xf32>, tensor<20x4096x64xf32>) {
      ^bb0(%arg7: f32, %arg8: f16, %arg9: f32, %arg10: f32, %arg11: f32):
        %18 = arith.addf %arg7, %arg10 : f32
        %19 = arith.truncf %arg7 : f32 to f16
        %20 = arith.extf %19 : f16 to f32
        %21 = arith.extf %arg8 : f16 to f32
        %22 = arith.mulf %20, %21 : f32
        %23 = arith.addf %22, %arg11 : f32
        iree_linalg_ext.yield %arg9, %18, %23 : f32, f32, f32
      } -> tensor<20x4096xf32>, tensor<20x4096xf32>, tensor<20x4096x64xf32>
      iree_tensor_ext.dispatch.tensor.store %17#2, %arg6, offsets = [0, 0, 0], sizes = [20, 4096, 64], strides = [1, 1, 1] : tensor<20x4096x64xf32> -> !iree_tensor_ext.dispatch.tensor<writeonly:tensor<20x4096x64xf32>>
      flow.return
    } count() -> (index, index, index) {
      %x, %y, %z = iree_tensor_ext.dispatch.workgroup_count_from_slice()
      flow.return %x, %y, %z : index, index, index
    }
    %4 = hal.tensor.export %3 "output0" : tensor<20x4096x64xf32> -> !hal.buffer_view
    util.return %4 : !hal.buffer_view
  }
}


// -----// IR Dump After AttributeCallGraphPass (iree-util-attribute-call-graph) //----- //
#config = #iree_cpu.lowering_config<distribution = [32, 16, 0, 0], vector_common_parallel = [0, 0, 0, 32]>
#config1 = #iree_cpu.lowering_config<distribution = [32, 16, 0, 0]>
#executable_target_embedded_elf_x86_64 = #hal.executable.target<"llvm-cpu", "embedded-elf-x86_64", {cpu = "", cpu_features = "", data_layout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128", iree.encoding.resolver = #iree_cpu.cpu_encoding_resolver<>, max_stack_allocation_size = 32768 : i64, native_vector_size = 16 : i64, target_triple = "x86_64-unknown-unknown-eabi-elf"}>
#map = affine_map<(d0, d1, d2, d3) -> (d0, d1, d3)>
#map1 = affine_map<(d0, d1, d2, d3) -> (d0, d2, d3)>
#map2 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2)>
#map3 = affine_map<(d0, d1, d2) -> (d0, d1, d2)>
#map4 = affine_map<(d0, d1, d2, d3) -> (d0, d3, d2)>
#map5 = affine_map<(d0, d1, d2, d3) -> (d0, d1)>
#device_target_local = #hal.device.target<"local", [#executable_target_embedded_elf_x86_64]> : !hal.device
module attributes {stream.affinity.default = #hal.device.affinity<@__device_0>} {
  util.global private @__device_0 = #device_target_local
  util.func public @attention(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub, iree.reflection = {iree.abi.declaration = "sync func @attention(%input0: tensor<20x4096x64xf16>, %input1: tensor<20x4096x64xf16>, %input2: tensor<20x4096x64xf16>) -> (%output0: tensor<20x4096x64xf32>)"}} {
    %0 = hal.tensor.import %arg0 "input0" : !hal.buffer_view -> tensor<20x4096x64xf16>
    %1 = hal.tensor.import %arg1 "input1" : !hal.buffer_view -> tensor<20x4096x64xf16>
